# CMPT354 - MP1 

SQLite Food Delivery Database

Load ipython-sql extension:

In [2]:
%load_ext sql

Create database 'delivery.db':

In [3]:
%sql sqlite:///delivery.db

'Connected: @delivery.db'

# Convert Entity Sets to Tables:

Create Customer table:

In [4]:
%%sql

PRAGMA foreign_keys = ON;

CREATE TABLE Customer(
    customerID      INT,
    firstName       VARCHAR(20),
    lastName        VARCHAR(20),
    email           VARCHAR(20),
    cusAddress      VARCHAR(100),    
    PRIMARY KEY     (customerID)
);

 * sqlite:///delivery.db
Done.
Done.

[]

In [ ]:
%%sql
DROP TABLE Customer;

Populate Customer table:

In [16]:
%%sql

INSERT INTO Customer(customerID, firstName, lastName, email, cusAddress)
VALUES  (5369, "John", "Patrick", "jpat@gmail.com", "7766 Apple St"),
        (4488, "Arnie", "Wright", "arnie_wright@yahoo.com", "8463 Stage Dr"),
        (3355, "Luis", "Dolan", "dolan1234@hotmail.com", "9472 Red St"),
        (1244, "Jennifer", "Long", "jenny_l@gmail.com", "1235 Winter Ave"),
        (9667, "Quinn", "Silva", "queen_silver@yahoo.com", "3984 Scholar St"),
        (2521, "Oliver", "Mayer", "olivermayer@yahoo.com", "5874 Heaven Ave"),
        (7930, "Stephen", "Potter", "stephen_p@gmail.com", "2736 Temple Dr"),
        (9480, "Natalie", "Blackmore", "nat_blackmore@hotmail.com", "3836 Parade Ave"),
        (2528, "Elsa", "Morgan", "elmorgan@yahoo.com", "4973 Brown St"),
        (9203, "Melinda", "Marshall", "mmarshall@yahoo.com", "3846 Reach Dr");

 * sqlite:///delivery.db
10 rows affected.

[]

In [28]:
%%sql
SELECT * FROM Customer;

 * sqlite:///delivery.db
Done.

[(5369, 'John', 'Patrick', 'jpat@gmail.com', '7766 Apple St'),
 (4488, 'Arnie', 'Wright', 'arnie_wright@yahoo.com', '8463 Stage Dr'),
 (3355, 'Luis', 'Dolan', 'dolan1234@hotmail.com', '9472 Red St'),
 (1244, 'Jennifer', 'Long', 'jenny_l@gmail.com', '1235 Winter Ave'),
 (9667, 'Quinn', 'Silva', 'queen_silver@yahoo.com', '3984 Scholar St'),
 (2521, 'Oliver', 'Mayer', 'olivermayer@yahoo.com', '5874 Heaven Ave'),
 (7930, 'Stephen', 'Potter', 'stephen_p@gmail.com', '2736 Temple Dr'),
 (9480, 'Natalie', 'Blackmore', 'nat_blackmore@hotmail.com', '3836 Parade Ave'),
 (2528, 'Elsa', 'Morgan', 'elmorgan@yahoo.com', '4973 Brown St'),
 (9203, 'Melinda', 'Marshall', 'mmarshall@yahoo.com', '3846 Reach Dr')]

<br>Create Payment table:

In [5]:
%%sql

CREATE TABLE Payment(
    payID          INT,
    payType        CHAR(4),
    payTotal       FLOAT,
    PRIMARY KEY    (payID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Payment;

Populate Payment table:

In [17]:
%%sql

INSERT INTO Payment(payID, payType, payTotal)
VALUES  (1949, "CASH", 35.00),
        (7454, "CARD", 15.27),
        (5680, "CASH", 18.50),
        (2904, "CARD", 54.58),
        (7562, "CARD", 43.98),
        (7744, "CARD", 39.05),
        (2377, "CARD", 13.65),
        (9004, "CASH", 29.50),
        (3615, "CASH", 36.30),
        (8168, "CARD", 51.12);

 * sqlite:///delivery.db
10 rows affected.

[]

In [29]:
%%sql
SELECT * FROM Payment;

 * sqlite:///delivery.db
Done.

[(1949, 'CASH', 35.0),
 (7454, 'CARD', 15.27),
 (5680, 'CASH', 18.5),
 (2904, 'CARD', 54.58),
 (7562, 'CARD', 43.98),
 (7744, 'CARD', 39.05),
 (2377, 'CARD', 13.65),
 (9004, 'CASH', 29.5),
 (3615, 'CASH', 36.3),
 (8168, 'CARD', 51.12)]

<br>Create OrderInstance table:

In [6]:
%%sql

CREATE TABLE OrderInstance(
    orderID         INT,
    orderTime       TIME,
    orderStatus     VARCHAR(30),
    totalPrice      FLOAT,    
    deliveryTime    TIME,
    PRIMARY KEY     (orderID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE OrderInstance;

Populate OrderInstance table:

In [18]:
%%sql

INSERT INTO OrderInstance(orderID, orderTime, orderStatus, totalPrice, deliveryTime)
VALUES  (4977, "2019-06-29 11:36", "Delivered", 30.75, "2019-06-29 12:14"),
        (2619, "2019-06-29 11:39", "On the Way", 13.67, ""),
        (3334, "2019-06-29 11:32", "Delivered", 16.98, "2019-06-29 12:10"),
        (5773, "2019-06-29 12:13", "Preparing Order", 45.98, ""),
        (4718, "2019-06-29 11:59", "On the Way", 37.15, ""),
        (1421, "2019-06-29 12:17", "Comfirming Order", 34.35, ""),
        (5420, "2019-06-29 11:46", "On the Way", 12.68, ""),
        (3735, "2019-06-29 12:05", "Preparing Order", 25.75, ""),
        (5644, "2019-06-29 11:48", "On the way", 32.00, ""),
        (7093, "2019-06-29 12:08", "Preparing Order", 43.10, "");

 * sqlite:///delivery.db
10 rows affected.

[]

In [30]:
%%sql
SELECT * FROM OrderInstance;

 * sqlite:///delivery.db
Done.

[(4977, '2019-06-29 11:36', 'Delivered', 30.75, '2019-06-29 12:14'),
 (2619, '2019-06-29 11:39', 'On the Way', 13.67, ''),
 (3334, '2019-06-29 11:32', 'Delivered', 16.98, '2019-06-29 12:10'),
 (5773, '2019-06-29 12:13', 'Preparing Order', 45.98, ''),
 (4718, '2019-06-29 11:59', 'On the Way', 37.15, ''),
 (1421, '2019-06-29 12:17', 'Comfirming Order', 34.35, ''),
 (5420, '2019-06-29 11:46', 'On the Way', 12.68, ''),
 (3735, '2019-06-29 12:05', 'Preparing Order', 25.75, ''),
 (5644, '2019-06-29 11:48', 'On the way', 32.0, ''),
 (7093, '2019-06-29 12:08', 'Preparing Order', 43.1, '')]

<br>Create Driver table:

In [7]:
%%sql

CREATE TABLE Driver(
    driverID        INT,
    firstName       VARCHAR(20),
    lastName        VARCHAR(20),
    carDesc         VARCHAR(50),
    PRIMARY KEY     (driverID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Driver;

Populate Driver table:

In [19]:
%%sql

INSERT INTO Driver(driverID, firstName, lastName, carDesc)
VALUES  (9919, "Prisha", "Bruce", "Honda 2012, Blue"),
        (6604, "Mark", "Plummer", "Chevrolet 2014, Black"),
        (8017, "Fallon", "Lee", "Nissan 2015, Gray"),
        (7436, "Bella", "Fellows", "Hyundai 2010, Pink"),
        (3539, "Kaleem", "Cooper", "Fiat 2016, Green"),
        (8545, "Alfred", "Perkins", "Mazda 2009, Blue"),
        (7043, "Philip", "Kemberton", "Ford 2010, Orange"),
        (2756, "Bert", "Wilkes", "Suzuki 2012, Red"),
        (3492, "Dominic", "Ramirez", "Citroen 2015, Black"),
        (5124, "Ivor", "Valentine", "Toyota 2013, White");

 * sqlite:///delivery.db
10 rows affected.

[]

In [31]:
%%sql
SELECT * FROM Driver;

 * sqlite:///delivery.db
Done.

[(9919, 'Prisha', 'Bruce', 'Honda 2012, Blue'),
 (6604, 'Mark', 'Plummer', 'Chevrolet 2014, Black'),
 (8017, 'Fallon', 'Lee', 'Nissan 2015, Gray'),
 (7436, 'Bella', 'Fellows', 'Hyundai 2010, Pink'),
 (3539, 'Kaleem', 'Cooper', 'Fiat 2016, Green'),
 (8545, 'Alfred', 'Perkins', 'Mazda 2009, Blue'),
 (7043, 'Philip', 'Kemberton', 'Ford 2010, Orange'),
 (2756, 'Bert', 'Wilkes', 'Suzuki 2012, Red'),
 (3492, 'Dominic', 'Ramirez', 'Citroen 2015, Black'),
 (5124, 'Ivor', 'Valentine', 'Toyota 2013, White')]

<br>Create Restaurant table:

In [8]:
%%sql

CREATE TABLE Restaurant(
    restName       VARCHAR(30),
    restAddress    VARCHAR(100),    
    cuisine        VARCHAR(30),
    restType       VARCHAR(30),
    rating         INT,
    PRIMARY KEY    (restName, restAddress)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Restaurant;

Populate Restaurant table:

In [20]:
%%sql

INSERT INTO Restaurant(restName, restAddress, cuisine, restType, rating)
VALUES  ("McDonald's", "4801 E Hastings St", "Burger", "Fast Food", 3.6),
        ("Grand Chinese", "4461 Lougheed Hwy", "Chinese", "Casual", 3.9),
        ("Subway", "2251 Holdom Ave", "Sandwich", "Fast Food", 3.4),
        ("White Lotus Cafe", "5901 Broadway", "Vietnamese", "Casual", 4.3),
        ("Poke Five", "2247 Commercial Dr", "Hawaiian", "Fast Casual", 4.2),
        ("Osaka Sushi", "4152 Hastings St", "Japanese", "Casual", 3.8),
        ("Red Burrito", "1700 Commercial Dr", "Mexican", "Fast Casual", 3.8),
        ("Papa John's Pizza", "4196 Dawson St", "Pizza", "Fast Casual", 2.9),
        ("ZenQ", "4569 E Hastings St", "Bubble Tea", "Cafe", 4.1),
        ("A&W", "4567 Lougheed Hwy", "Burger", "Fast Food", 3.2);

 * sqlite:///delivery.db
10 rows affected.

[]

In [32]:
%%sql
SELECT * FROM Restaurant;

 * sqlite:///delivery.db
Done.

[("McDonald's", '4801 E Hastings St', 'Burger', 'Fast Food', 3.6),
 ('Grand Chinese', '4461 Lougheed Hwy', 'Chinese', 'Casual', 3.9),
 ('Subway', '2251 Holdom Ave', 'Sandwich', 'Fast Food', 3.4),
 ('White Lotus Cafe', '5901 Broadway', 'Vietnamese', 'Casual', 4.3),
 ('Poke Five', '2247 Commercial Dr', 'Hawaiian', 'Fast Casual', 4.2),
 ('Osaka Sushi', '4152 Hastings St', 'Japanese', 'Casual', 3.8),
 ('Red Burrito', '1700 Commercial Dr', 'Mexican', 'Fast Casual', 3.8),
 ("Papa John's Pizza", '4196 Dawson St', 'Pizza', 'Fast Casual', 2.9),
 ('ZenQ', '4569 E Hastings St', 'Bubble Tea', 'Cafe', 4.1),
 ('A&W', '4567 Lougheed Hwy', 'Burger', 'Fast Food', 3.2)]

<br>Create Menu table

In [9]:
%%sql

CREATE TABLE Menu(
    menuID INT,
    itemID INT,
    PRIMARY KEY (menuID, itemID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Menu;

Populate Menu table:

In [21]:
%%sql

INSERT INTO Menu(menuID, itemID)
VALUES  (7950, 1),(7950, 2),(7950, 3),(7950, 4),(7950, 5),
        (2874, 1),(2874, 2),(2874, 3),(2874, 4),(2874, 5),
        (1537, 1),(1537, 2),(1537, 3),(1537, 4),(1537, 5),
        (8175, 1),(8175, 2),(8175, 3),(8175, 4),(8175, 5),
        (1257, 1),(1257, 2),(1257, 3),(1257, 4),(1257, 5),
        (6571, 1),(6571, 2),(6571, 3),(6571, 4),(6571, 5),
        (9166, 1),(9166, 2),(9166, 3),(9166, 4),(9166, 5),
        (9421, 1),(9421, 2),(9421, 3),(9421, 4),(9421, 5),
        (5712, 1),(5712, 2),(5712, 3),(5712, 4),(5712, 5),
        (1967, 1),(1967, 2),(1967, 3),(1967, 4),(1967, 5);

 * sqlite:///delivery.db
50 rows affected.

[]

In [33]:
%%sql
SELECT * FROM Menu;

 * sqlite:///delivery.db
Done.

[(7950, 1),
 (7950, 2),
 (7950, 3),
 (7950, 4),
 (7950, 5),
 (2874, 1),
 (2874, 2),
 (2874, 3),
 (2874, 4),
 (2874, 5),
 (1537, 1),
 (1537, 2),
 (1537, 3),
 (1537, 4),
 (1537, 5),
 (8175, 1),
 (8175, 2),
 (8175, 3),
 (8175, 4),
 (8175, 5),
 (1257, 1),
 (1257, 2),
 (1257, 3),
 (1257, 4),
 (1257, 5),
 (6571, 1),
 (6571, 2),
 (6571, 3),
 (6571, 4),
 (6571, 5),
 (9166, 1),
 (9166, 2),
 (9166, 3),
 (9166, 4),
 (9166, 5),
 (9421, 1),
 (9421, 2),
 (9421, 3),
 (9421, 4),
 (9421, 5),
 (5712, 1),
 (5712, 2),
 (5712, 3),
 (5712, 4),
 (5712, 5),
 (1967, 1),
 (1967, 2),
 (1967, 3),
 (1967, 4),
 (1967, 5)]

<br>Create Items table:

In [10]:
%%sql

CREATE TABLE Items(
    menuID          INT,
    itemID          INT,
    itemName        VARCHAR(30),
    itemPrice       FLOAT,
    PRIMARY KEY     (menuID, itemID),
    FOREIGN KEY     (menuID, itemID)
    REFERENCES      Menu (menuID, itemID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Items;

Populate Items table:

In [22]:
%%sql

INSERT INTO Items(menuID, itemID, itemName, itemPrice)
VALUES  (7950, 1, "Quarter Pounder with Cheese", 5.89),
        (7950, 2, "Big Mac", 5.89),
        (7950, 3, "McChicken", 5.69),
        (7950, 4, "French Fries", 2.79),
        (7950, 5, "Junior Chicken", 1.99),
        (2874, 1, "Szechuan-Style Peppery Chicken", 17.25),
        (2874, 2, "Beef and Broccoli", 16.25),
        (2874, 3, "Szechuan Beef Noodle Soup", 10.25),
        (2874, 4, "Shanghai Dumplings", 8.95),
        (2874, 5, "Steamed Pork Buns", 9.25),
        (1537, 1, "Black Forest Ham Sub", 8.79),
        (1537, 2, "Meatball Marinara Sub", 8.49),
        (1537, 3, "Oven Roasted Chicken Sub", 10.49),
        (1537, 4, "Garlic Steak Ciabatta", 7.69),
        (1537, 5, "Grilled Cheese Ciabatta", 5.49),
        (8175, 1, "Spring Rolls", 5.50),
        (8175, 2, "Salad Rolls", 5.50),
        (8175, 3, "BBQ Pork Banh Mi Sandwich", 5.75),
        (8175, 4, "House Special Pho", 11.00),
        (8175, 5, "Vermicelli Bowl", 11.00),
        (1257, 1, "The Drive", 14.50),
        (1257, 2, "Simply Poke", 14.50),
        (1257, 3, "Ahi Hawaii", 14.50),
        (1257, 4, "Akuma Tuna", 14.50),
        (1257, 5, "Buddha Bowl", 13.50),
        (6571, 1, "Miso Soup", 1.50),
        (6571, 2, "Chicken Karaage", 6.95),
        (6571, 3, "Roll Combo", 10.45),
        (6571, 4, "Tuna Salmon Combo", 12.95),
        (6571, 5, "Beef Teriyaki Don", 10.95),
        (9166, 1, "Red Burrito", 10.30),
        (9166, 2, "Tamale", 5.50),
        (9166, 3, "Burrito in a Bowl", 10.30),
        (9166, 4, "Quesadilla", 10.30),
        (9166, 5, "Chips with Guacamole", 4.60),
        (9421, 1, "Small Sausage Pizza", 10.99),
        (9421, 2, "Medium Cheese Pizza", 11.99),
        (9421, 3, "Medium BBQ Chicken Bacon Pizza", 19.99),
        (9421, 4, "Large Pepperoni Pizza", 16.99),
        (9421, 5, "Large Hawaiian Pizza", 25.99),
        (5712, 1, "Original Milk Tea", 5.50),
        (5712, 2, "Mango Smoothie", 5.99),
        (5712, 3, "Jasmine Green Milk Tea", 5.50),
        (5712, 4, "Winter Melon Tea Latte", 5.99),
        (5712, 5, "Lychee Black Tea", 5.75),
        (1967, 1, "Teen Burger", 6.69),
        (1967, 2, "Mama Burger", 5.09),
        (1967, 3, "Papa Burger", 6.69),
        (1967, 4, "Chubby Chicken Burger", 6.89),
        (1967, 5, "Russet Thick Cut Fries", 2.99);

 * sqlite:///delivery.db
50 rows affected.

[]

In [34]:
%%sql  
SELECT * FROM Items;

 * sqlite:///delivery.db
Done.

[(7950, 1, 'Quarter Pounder with Cheese', 5.89),
 (7950, 2, 'Big Mac', 5.89),
 (7950, 3, 'McChicken', 5.69),
 (7950, 4, 'French Fries', 2.79),
 (7950, 5, 'Junior Chicken', 1.99),
 (2874, 1, 'Szechuan-Style Peppery Chicken', 17.25),
 (2874, 2, 'Beef and Broccoli', 16.25),
 (2874, 3, 'Szechuan Beef Noodle Soup', 10.25),
 (2874, 4, 'Shanghai Dumplings', 8.95),
 (2874, 5, 'Steamed Pork Buns', 9.25),
 (1537, 1, 'Black Forest Ham Sub', 8.79),
 (1537, 2, 'Meatball Marinara Sub', 8.49),
 (1537, 3, 'Oven Roasted Chicken Sub', 10.49),
 (1537, 4, 'Garlic Steak Ciabatta', 7.69),
 (1537, 5, 'Grilled Cheese Ciabatta', 5.49),
 (8175, 1, 'Spring Rolls', 5.5),
 (8175, 2, 'Salad Rolls', 5.5),
 (8175, 3, 'BBQ Pork Banh Mi Sandwich', 5.75),
 (8175, 4, 'House Special Pho', 11.0),
 (8175, 5, 'Vermicelli Bowl', 11.0),
 (1257, 1, 'The Drive', 14.5),
 (1257, 2, 'Simply Poke', 14.5),
 (1257, 3, 'Ahi Hawaii', 14.5),
 (1257, 4, 'Akuma Tuna', 14.5),
 (1257, 5, 'Buddha Bowl', 13.5),
 (6571, 1, 'Miso Soup', 1.5),
 (6571, 2, 'Chicken Karaage', 6.95),
 (6571, 3, 'Roll Combo', 10.45),
 (6571, 4, 'Tuna Salmon Combo', 12.95),
 (6571, 5, 'Beef Teriyaki Don', 10.95),
 (9166, 1, 'Red Burrito', 10.3),
 (9166, 2, 'Tamale', 5.5),
 (9166, 3, 'Burrito in a Bowl', 10.3),
 (9166, 4, 'Quesadilla', 10.3),
 (9166, 5, 'Chips with Guacamole', 4.6),
 (9421, 1, 'Small Sausage Pizza', 10.99),
 (9421, 2, 'Medium Cheese Pizza', 11.99),
 (9421, 3, 'Medium BBQ Chicken Bacon Pizza', 19.99),
 (9421, 4, 'Large Pepperoni Pizza', 16.99),
 (9421, 5, 'Large Hawaiian Pizza', 25.99),
 (5712, 1, 'Original Milk Tea', 5.5),
 (5712, 2, 'Mango Smoothie', 5.99),
 (5712, 3, 'Jasmine Green Milk Tea', 5.5),
 (5712, 4, 'Winter Melon Tea Latte', 5.99),
 (5712, 5, 'Lychee Black Tea', 5.75),
 (1967, 1, 'Teen Burger', 6.69),
 (1967, 2, 'Mama Burger', 5.09),
 (1967, 3, 'Papa Burger', 6.69),
 (1967, 4, 'Chubby Chicken Burger', 6.89),
 (1967, 5, 'Russet Thick Cut Fries', 2.99)]

# Convert Relationships to Tables:

Create Pays table:

In [11]:
%%sql

CREATE TABLE Pays(
    customerID     INT,
    payID          INT,
    PRIMARY KEY    (customerID, payID),
    FOREIGN KEY    (customerID) 
    REFERENCES     Customer (customerID),
    FOREIGN KEY    (payID)
    REFERENCES     Payment (payID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Pays;

Populate Pays table:

In [23]:
%%sql

INSERT INTO Pays(customerID, payID)
VALUES  (5369, 1949),
        (4488, 7454),
        (3355, 5680),
        (1244, 2904),
        (9667, 7562),
        (2521, 7744),
        (7930, 2377),
        (9480, 9004),
        (2528, 3615),
        (9203, 8168);

 * sqlite:///delivery.db
10 rows affected.

[]

In [35]:
%%sql
SELECT * FROM Pays;

 * sqlite:///delivery.db
Done.

[(5369, 1949),
 (4488, 7454),
 (3355, 5680),
 (1244, 2904),
 (9667, 7562),
 (2521, 7744),
 (7930, 2377),
 (9480, 9004),
 (2528, 3615),
 (9203, 8168)]

<br>Create Delivers table:

In [12]:
%%sql

CREATE TABLE Delivers(
    driverID       INT,
    orderID        INT,
    PRIMARY KEY    (driverID, orderID),
    FOREIGN KEY    (driverID)
    REFERENCES     Driver (driverID),
    FOREIGN KEY    (orderID)
    REFERENCES     OrderInstance (orderID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Delivers;

Populate Delivers table:

In [24]:
%%sql

INSERT INTO Delivers(driverID, orderID)
VALUES  (9919, 4977),
        (6604, 2619),
        (8017, 3334),
        (7436, 5773),
        (3539, 4718),
        (8545, 1421),
        (7043, 5420),
        (2756, 3735),
        (3492, 5644),
        (5124, 7093);

 * sqlite:///delivery.db
10 rows affected.

[]

In [36]:
%%sql
SELECT * FROM Delivers;

 * sqlite:///delivery.db
Done.

[(9919, 4977),
 (6604, 2619),
 (8017, 3334),
 (7436, 5773),
 (3539, 4718),
 (8545, 1421),
 (7043, 5420),
 (2756, 3735),
 (3492, 5644),
 (5124, 7093)]

<br>Create Orders table:

In [13]:
%%sql

CREATE TABLE Orders(
    customerID     INT,
    orderID        INT,
    PRIMARY KEY    (customerID, orderID),
    FOREIGN KEY    (customerID)
    REFERENCES     Customer (customerID),
    FOREIGN KEY    (orderID)
    REFERENCES     OrderInstance (orderID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Orders;

Populate Orders table:

In [25]:
%%sql

INSERT INTO Orders(customerID, orderID)
VALUES  (5369, 4977),
        (4488, 2619),
        (3355, 3334),
        (1244, 5773),
        (9667, 4718),
        (2521, 1421),
        (7930, 5420),
        (9480, 3735),
        (2528, 5644),
        (9203, 7093);

 * sqlite:///delivery.db
10 rows affected.

[]

In [37]:
%%sql
SELECT * FROM Orders;

 * sqlite:///delivery.db
Done.

[(5369, 4977),
 (4488, 2619),
 (3355, 3334),
 (1244, 5773),
 (9667, 4718),
 (2521, 1421),
 (7930, 5420),
 (9480, 3735),
 (2528, 5644),
 (9203, 7093)]

<br>Create Owns table:

In [14]:
%%sql

CREATE TABLE Owns(
    restName      VARCHAR(30),
    restAddress   VARCHAR(100),
    menuID        INT,
    itemID        INT,
    PRIMARY KEY   (restName, restAddress, menuID, itemID),
    FOREIGN KEY   (restName, restAddress)
    REFERENCES    Restaurant (restName, restAddress),
    FOREIGN KEY   (menuID, itemID)
    REFERENCES    Menu (menuID, itemID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Owns;

Populate Owns table:

In [26]:
%%sql

INSERT INTO Owns(restName, restAddress, menuID, itemID)
VALUES  ("McDonald's", "4801 E Hastings St", 7950, 1),
        ("McDonald's", "4801 E Hastings St", 7950, 2),
        ("McDonald's", "4801 E Hastings St", 7950, 3),
        ("McDonald's", "4801 E Hastings St", 7950, 4),
        ("McDonald's", "4801 E Hastings St", 7950, 5),
        ("Grand Chinese", "4461 Lougheed Hwy", 2874, 1),
        ("Grand Chinese", "4461 Lougheed Hwy", 2874, 2),
        ("Grand Chinese", "4461 Lougheed Hwy", 2874, 3),
        ("Grand Chinese", "4461 Lougheed Hwy", 2874, 4),
        ("Grand Chinese", "4461 Lougheed Hwy", 2874, 5),
        ("Subway", "2251 Holdom Ave", 1537, 1),
        ("Subway", "2251 Holdom Ave", 1537, 2),
        ("Subway", "2251 Holdom Ave", 1537, 3),
        ("Subway", "2251 Holdom Ave", 1537, 4),
        ("Subway", "2251 Holdom Ave", 1537, 5),
        ("White Lotus Cafe", "5901 Broadway", 8175, 1),
        ("White Lotus Cafe", "5901 Broadway", 8175, 2),
        ("White Lotus Cafe", "5901 Broadway", 8175, 3),
        ("White Lotus Cafe", "5901 Broadway", 8175, 4),
        ("White Lotus Cafe", "5901 Broadway", 8175, 5),
        ("Poke Five", "2247 Commercial Dr", 1257, 1),
        ("Poke Five", "2247 Commercial Dr", 1257, 2),
        ("Poke Five", "2247 Commercial Dr", 1257, 3),
        ("Poke Five", "2247 Commercial Dr", 1257, 4),
        ("Poke Five", "2247 Commercial Dr", 1257, 5),
        ("Osaka Sushi", "4152 Hastings St", 6571, 1),
        ("Osaka Sushi", "4152 Hastings St", 6571, 2),
        ("Osaka Sushi", "4152 Hastings St", 6571, 3),
        ("Osaka Sushi", "4152 Hastings St", 6571, 4),
        ("Osaka Sushi", "4152 Hastings St", 6571, 5),
        ("Red Burrito", "1700 Commercial Dr", 9166, 1),
        ("Red Burrito", "1700 Commercial Dr", 9166, 2),
        ("Red Burrito", "1700 Commercial Dr", 9166, 3),
        ("Red Burrito", "1700 Commercial Dr", 9166, 4),
        ("Red Burrito", "1700 Commercial Dr", 9166, 5),
        ("Papa John's Pizza", "4196 Dawson St", 9421, 1),
        ("Papa John's Pizza", "4196 Dawson St", 9421, 2),
        ("Papa John's Pizza", "4196 Dawson St", 9421, 3),
        ("Papa John's Pizza", "4196 Dawson St", 9421, 4),
        ("Papa John's Pizza", "4196 Dawson St", 9421, 5),
        ("ZenQ", "4569 E Hastings St", 5712, 1),
        ("ZenQ", "4569 E Hastings St", 5712, 2),
        ("ZenQ", "4569 E Hastings St", 5712, 3),
        ("ZenQ", "4569 E Hastings St", 5712, 4),
        ("ZenQ", "4569 E Hastings St", 5712, 5),
        ("A&W", "4567 Lougheed Hwy", 1967, 1),
        ("A&W", "4567 Lougheed Hwy", 1967, 2),
        ("A&W", "4567 Lougheed Hwy", 1967, 3),
        ("A&W", "4567 Lougheed Hwy", 1967, 4),
        ("A&W", "4567 Lougheed Hwy", 1967, 5);

 * sqlite:///delivery.db
50 rows affected.

[]

In [38]:
%%sql
SELECT * FROM Owns;

 * sqlite:///delivery.db
Done.

[("McDonald's", '4801 E Hastings St', 7950, 1),
 ("McDonald's", '4801 E Hastings St', 7950, 2),
 ("McDonald's", '4801 E Hastings St', 7950, 3),
 ("McDonald's", '4801 E Hastings St', 7950, 4),
 ("McDonald's", '4801 E Hastings St', 7950, 5),
 ('Grand Chinese', '4461 Lougheed Hwy', 2874, 1),
 ('Grand Chinese', '4461 Lougheed Hwy', 2874, 2),
 ('Grand Chinese', '4461 Lougheed Hwy', 2874, 3),
 ('Grand Chinese', '4461 Lougheed Hwy', 2874, 4),
 ('Grand Chinese', '4461 Lougheed Hwy', 2874, 5),
 ('Subway', '2251 Holdom Ave', 1537, 1),
 ('Subway', '2251 Holdom Ave', 1537, 2),
 ('Subway', '2251 Holdom Ave', 1537, 3),
 ('Subway', '2251 Holdom Ave', 1537, 4),
 ('Subway', '2251 Holdom Ave', 1537, 5),
 ('White Lotus Cafe', '5901 Broadway', 8175, 1),
 ('White Lotus Cafe', '5901 Broadway', 8175, 2),
 ('White Lotus Cafe', '5901 Broadway', 8175, 3),
 ('White Lotus Cafe', '5901 Broadway', 8175, 4),
 ('White Lotus Cafe', '5901 Broadway', 8175, 5),
 ('Poke Five', '2247 Commercial Dr', 1257, 1),
 ('Poke Five', '2247 Commercial Dr', 1257, 2),
 ('Poke Five', '2247 Commercial Dr', 1257, 3),
 ('Poke Five', '2247 Commercial Dr', 1257, 4),
 ('Poke Five', '2247 Commercial Dr', 1257, 5),
 ('Osaka Sushi', '4152 Hastings St', 6571, 1),
 ('Osaka Sushi', '4152 Hastings St', 6571, 2),
 ('Osaka Sushi', '4152 Hastings St', 6571, 3),
 ('Osaka Sushi', '4152 Hastings St', 6571, 4),
 ('Osaka Sushi', '4152 Hastings St', 6571, 5),
 ('Red Burrito', '1700 Commercial Dr', 9166, 1),
 ('Red Burrito', '1700 Commercial Dr', 9166, 2),
 ('Red Burrito', '1700 Commercial Dr', 9166, 3),
 ('Red Burrito', '1700 Commercial Dr', 9166, 4),
 ('Red Burrito', '1700 Commercial Dr', 9166, 5),
 ("Papa John's Pizza", '4196 Dawson St', 9421, 1),
 ("Papa John's Pizza", '4196 Dawson St', 9421, 2),
 ("Papa John's Pizza", '4196 Dawson St', 9421, 3),
 ("Papa John's Pizza", '4196 Dawson St', 9421, 4),
 ("Papa John's Pizza", '4196 Dawson St', 9421, 5),
 ('ZenQ', '4569 E Hastings St', 5712, 1),
 ('ZenQ', '4569 E Hastings St', 5712, 2),
 ('ZenQ', '4569 E Hastings St', 5712, 3),
 ('ZenQ', '4569 E Hastings St', 5712, 4),
 ('ZenQ', '4569 E Hastings St', 5712, 5),
 ('A&W', '4567 Lougheed Hwy', 1967, 1),
 ('A&W', '4567 Lougheed Hwy', 1967, 2),
 ('A&W', '4567 Lougheed Hwy', 1967, 3),
 ('A&W', '4567 Lougheed Hwy', 1967, 4),
 ('A&W', '4567 Lougheed Hwy', 1967, 5)]

<br>Create Includes table:

In [15]:
%%sql

CREATE TABLE Includes(
    orderID        INT,
    menuID         INT,
    itemID         INT,
    quantity       INT,
    PRIMARY KEY    (orderID, menuID, itemID),
    FOREIGN KEY    (orderID)
    REFERENCES     OrderInstance (orderID),
    FOREIGN KEY    (menuID, itemID)
    REFERENCES     Items (menuID, itemID)
);

 * sqlite:///delivery.db
Done.

[]

In [ ]:
%%sql
DROP TABLE Includes;

Populate Includes table:

In [27]:
%%sql

INSERT INTO Includes(orderID, menuID, itemID, quantity)
VALUES  (4977, 8175, 1, 1),
        (4977, 8175, 2, 1),
        (4977, 8175, 3, 1),
        (4977, 8175, 4, 1),
        (2619, 7950, 1, 1),
        (2619, 7950, 4, 1),
        (2619, 7950, 5, 1),
        (3334, 1537, 2, 1),
        (3334, 1537, 5, 1),
        (5773, 9421, 4, 1),
        (5773, 9421, 5, 1),
        (4718, 2874, 2, 1),
        (4718, 2874, 4, 2),
        (1421, 6571, 1, 2),
        (1421, 6571, 2, 1),
        (1421, 6571, 3, 1),
        (1421, 6571, 5, 1),
        (5420, 1967, 1, 1),
        (5420, 1967, 5, 1),
        (3735, 5712, 1, 2),
        (3735, 5712, 3, 1),
        (3735, 5712, 5, 1),
        (5644, 1257, 2, 1),
        (5644, 1257, 4, 1),
        (7093, 9166, 1, 2),
        (7093, 9166, 3, 1),
        (7093, 9166, 5, 2);

 * sqlite:///delivery.db
27 rows affected.

[]

In [39]:
%%sql
SELECT * FROM Includes;

 * sqlite:///delivery.db
Done.

[(4977, 8175, 1, 1),
 (4977, 8175, 2, 1),
 (4977, 8175, 3, 1),
 (4977, 8175, 4, 1),
 (2619, 7950, 1, 1),
 (2619, 7950, 4, 1),
 (2619, 7950, 5, 1),
 (3334, 1537, 2, 1),
 (3334, 1537, 5, 1),
 (5773, 9421, 4, 1),
 (5773, 9421, 5, 1),
 (4718, 2874, 2, 1),
 (4718, 2874, 4, 2),
 (1421, 6571, 1, 2),
 (1421, 6571, 2, 1),
 (1421, 6571, 3, 1),
 (1421, 6571, 5, 1),
 (5420, 1967, 1, 1),
 (5420, 1967, 5, 1),
 (3735, 5712, 1, 2),
 (3735, 5712, 3, 1),
 (3735, 5712, 5, 1),
 (5644, 1257, 2, 1),
 (5644, 1257, 4, 1),
 (7093, 9166, 1, 2),
 (7093, 9166, 3, 1),
 (7093, 9166, 5, 2)]